Tekla Open API Reference for Tekla Structures 2025
DrawingPluginBase.DefineInput Method
 The method Tekla Structures calls for the plug-in to query the input. The plug-in must then return an array list of input definition instances. The plug-in will be dependent on the items it returns. Dependent means that if any of these items change, for example the user moves the points, the plug-in will be re-run with new input. DefineInput is not called during the re-run, and thus all the actual implementation should be in the Run() method. The Run() method is always called in view coordinates.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract List<DrawingPluginBase.InputDefinition> DefineInput()
Public MustOverride Function DefineInput As List(Of DrawingPluginBase.InputDefinition)
Return Value
Type: List<DrawingPluginBase.InputDefinition>
An array list of input definition instances. If the plug-in is not dependent on input, it should return an empty array list (not null).
See Also
Reference
DrawingPluginBase Class
Tekla.Structures.Plugins Namespace